consult-gh.org
*** define consult gh repo list
#+begin_src emacs-lisp
(defun consult-gh-orgs (&optional orgs)
"Get a list of organizations from the user and provide their repos."
  (interactive
   (let* ((crm-separator consult-gh-crm-separator)
         (candidates (or (delete-dups (append consult-gh-default-orgs-list consult-gh--known-orgs-list)) (list))))
   (list (delete-dups (completing-read-multiple "Search GitHub Users/Organization: " candidates nil nil nil 'consult-gh--org-history nil t)))))

  (let ((candidates (consult--slow-operation "Collecting Repos ..." (mapcar #'consult-gh--make-source-from-org orgs))))
    (if (not (member nil (mapcar (lambda (cand) (plist-get cand :items)) candidates)))
      (progn
          (setq consult-gh--known-orgs-list (append consult-gh--known-orgs-list orgs))
          (consult--multi candidates
                    :prompt "Select User/Organization: "
                    :require-match nil
                    :sort t
                    :group #'consult-gh--repo-group
                    :history 'consult-gh--repos-history
                    :category 'consult-gh
                    :sort t
                    )))))
#+end_src
*** define consult gh default repos
#+begin_src emacs-lisp
(defun consult-gh-default-repos ()
"Show the repos from default organizaitons."
  (interactive)
(consult-gh-orgs consult-gh-default-orgs-list))
#+end_src

*** define consult gh search repos
#+begin_src emacs-lisp
(defun consult-gh-search-repos (&optional repos)

"Get a list of repos from the user and return the results in `consult-gh' menu by runing \"gh search repos\"."
  (interactive
   (let* ((crm-separator consult-gh-crm-separator)
         (candidates (or (delete-dups consult-gh--known-repos-list) (list))))
   (list (delete-dups (completing-read-multiple "Search GitHub Repositories: " candidates nil nil nil nil nil t)))))
  (let ((candidates (consult--slow-operation "Collecting Repos ..." (mapcar #'consult-gh--make-source-from-search-repo repos))))
    (if (not (member nil (mapcar (lambda (cand) (plist-get cand :items)) candidates)))
      (progn
          (setq consult-gh--known-repos-list (append consult-gh--known-repos-list repos))
          (consult--multi candidates
                    :prompt "Select Repositories(s): "
                    :require-match t
                    :sort nil
                    :group #'consult-gh--repo-group
                    :history 'consult-gh--repos-history
                    :category 'consult-gh
                    :sort t
                    ))
      (message (concat "consult-gh: " (propertize "no repositories matched your search!" 'face 'warning))))))

#+end_src

*** define consult gh issue list
#+begin_src emacs-lisp
(defun consult-gh-issue-list (&optional repos)
"Get a list of repos from the user and return the results in `consult-gh' menu by runing \"gh search repos\"."
  (interactive
   (let* ((crm-separator consult-gh-crm-separator)
         (candidates (or (delete-dups consult-gh--known-repos-list) (list))))
   (list (delete-dups (completing-read-multiple "Search GitHub Repositories: " candidates nil nil nil nil nil t)))))
  (let ((candidates (consult--slow-operation "Collecting Issues ..." (mapcar #'consult-gh--make-source-from-issues repos))))
    (if (not (member nil (mapcar (lambda (cand) (plist-get cand :items)) candidates)))
      (progn
          (setq consult-gh--known-repos-list (append consult-gh--known-repos-list repos))
          (consult--multi candidates
                    :prompt "Select Issue(s): "
                    :require-match t
                    :sort t
                    :group #'consult-gh--issue-group
                    :preview-key 'any
                    :history 'consult-gh--issues-history
                    :category 'consult-gh
                    :sort t
                    )
          )
      (message (concat "consult-gh: " (propertize "no repositories matched your search!" 'face 'warning))))))
#+end_src

*** consult gh browse repo
#+begin_src emacs-lisp
(defun consult-gh-browse-repo-files (&optional repos)

  "Get a list of repos from the user and return the results in `consult-gh' menu by runing \"gh search repos\"."
  (interactive
   (let* ((crm-separator consult-gh-crm-separator)
         (candidates (or (delete-dups consult-gh--known-repos-list) (list))))
     (list (delete-dups (completing-read-multiple "Select Repository(s): " candidates nil nil nil nil nil t)))))
  (let ((branches (list)))
    (pcase consult-gh-default-branch-to-load
      ('ask
    (if (y-or-n-p "Load Default HEAD branch?")
        (setq branches (mapcar (lambda (repo) (cons repo "HEAD")) repos))
      (setq branches (cl-loop for repo in repos
                              collect (cons repo (completing-read (concat "Select Branch for " (propertize (format "\"%s\"" repo) 'face 'consult-gh-default-face) ": ") (consult-gh--files-branches-list-items repo)))))))
      ('nil
        (setq branches (mapcar (lambda (repo) (cons repo "HEAD")) repos))
        )
      (_
        (setq branches (mapcar (lambda (repo) (cons repo (format "%s" consult-gh-default-branch-to-load))) repos))))
    (let ((consult-gh-tempdir (expand-file-name (make-temp-name "") consult-gh-tempdir))
          (candidates (consult--slow-operation "Collecting Contents ..." (mapcar (lambda (repo) (consult-gh--make-source-from-files repo (alist-get repo branches))) repos)))
          )
      (if (not (member nil (mapcar (lambda (cand) (plist-get cand :items)) candidates)))
          (progn
            (setq consult-gh--known-repos-list (append consult-gh--known-repos-list repos))
            (consult--multi candidates
                            :prompt "Select File: "
                            :require-match t
                            :sort t
                            :group #'consult-gh--files-group
                            :history 'consult-gh--repos-history
                            :category 'consult-gh-files
                            :sort t
                            ))
        (message (concat "consult-gh: " (propertize "no contents matched your repo!" 'face 'warning)))))))


;; (setq my:test '("a" "b" "c"))
;; (setq my:test2 (repeat "header" (length my:test)))


;; (let ((brnaches (list))
;;       (repos '("armindarvish/consult-gh" "minad/vertico")))
;;   (if (y-or-n-p "Load Default HEAD branch?")
;;       (setq branches (mapcar (lambda (repo) (cons repo "HEAD")) repos))
;;     (setq branches (cl-loop for repo in repos
;;                             collect (cons repo (completing-read "branch: " (consult-gh--files-branches-list-items repo))))))
;;   (alist-get (car repos) branches))


#+end_src
** provide
#+begin_src emacs-lisp
(provide 'consult-gh)
#+end_src
** footer
#+begin_src emacs-lisp
;;; filename ends here
#+end_src
* embark
** header
#+begin_src  emacs-lisp :tangle ./consult-gh-embark.el
;;; consult-gh-embark.el --- Emabrk Actions for consult-gh -*- lexical-binding: t -*-

;; Copyright (C) 2021-2023 Free Software Foundation, Inc.

;; Author: Armin Darvish
;; Maintainer: Armin Darvish
;; Created: 2023
;; Version: 0.1
;; Package-Requires: ((emacs "27.1") (consult "0.34") (gh "2.29"))
;; Homepage: https://github.com/armindarvish/consult-gh
;; Keywords: matching, git, repositories, forges, completion

;;; Commentary:

;;; Code:
#+end_src
