consult-gh.org
** main
#+begin_src emacs-lisp :tangle ./consult-gh-embark.el

(require 'embark)
(require 'consult-gh)

(defun consult-gh-embark-open-in-browser (cand)
  "Open the link in browser"
  (let* ((repo (get-text-property 0 :repo cand))
         (issue (or (get-text-property 0 :issue cand) nil))
         (path (or (get-text-property 0 :path cand) nil)))
    (if issue
        (consult-gh--call-process "issue" "view" "--web" "--repo" (substring-no-properties repo) (substring-no-properties issue))
      (if path
        (browse-url (concat (string-trim (consult-gh--command-to-string "browse" "--repo" repo "--no-browser")) "/blob/HEAD/" path))
        (consult-gh--call-process "repo" "view" "--web" (substring repo))))))

(defun consult-gh-embark-get-ssh-link (cand)
  "Copy the ssh based link of the repo to `kill-ring'."
  (kill-new (concat "git@github.com:" (string-trim  (get-text-property 0 :repo cand))) ".git"))

(defun consult-gh-embark-get-https-link (cand)
  "Copy the http based link of the repo to `kill-ring'."
  (kill-new (concat "https://github.com/" (string-trim (get-text-property 0 :repo cand))) ".git"))

(defun consult-gh-embark-get-straight-usepackage (cand)
  "Copy a drop-in straight use package setup of this repo to `kill-ring'."
  (let* ((repo (get-text-property 0 :repo cand))
         (package (car (last (split-string repo "\/"))))
         )
    (kill-new (concat "(use-package " package "\n\t:straight (" package " :type git :host github :repo \"" repo  "\")\n)"))))

(defun consult-gh-embark-get-other-repos-by-same-user (cand)
  "List other repos by the same user/organization as the repo at point."
  (let* ((repo  (get-text-property 0 :repo cand))
         (user (car (split-string repo "\/"))))
    (consult-gh-orgs `(,user))))

(defun consult-gh-embark-view-issues-of-repo (cand)
  "View issues of the repo at point."
  (let* ((repo (get-text-property 0 :repo cand))
         )
    (consult-gh-issue-list `(,repo))))

(defun consult-gh-embark-clone-repo (cand)
  "Clone the repo at point."
  (funcall (consult-gh--repo-clone-action) (get-text-property 0 :repo cand)))


(defun consult-gh-embark-fork-repo (cand)
  "Fork the repo at point."
  (funcall (consult-gh--repo-fork-action) (get-text-property 0 :repo cand)))

(defun consult-gh-embark-save-file (cand)
  "Save the file at point."
  (funcall (consult-gh--files-save-file-action) cand))

(defvar-keymap consult-gh-embark-actions-map
  :doc "Keymap for consult-gh-embark"
  :parent embark-general-map
  "l s" #'consult-gh-embark-get-ssh-link
  "l h" #'consult-gh-embark-get-https-link
  "e" #'consult-gh-embark-get-straight-usepackage
  "c" #'consult-gh-embark-clone-repo
  "f" #'consult-gh-embark-fork-repo
  "x" #'consult-gh-embark-get-other-repos-by-same-user
  "z" #'consult-gh-embark-view-issues-of-repo
  "o" #'consult-gh-embark-open-in-browser
)

(add-to-list 'embark-keymap-alist '(consult-gh . consult-gh-embark-actions-map))


(defvar-keymap consult-gh-embark-files-actions-map
  :doc "Keymap for consult-gh-embark-files"
  :parent consult-gh-embark-actions-map
  "s" #'consult-gh-embark-save-file)

(add-to-list 'embark-keymap-alist '(consult-gh-files . consult-gh-embark-files-actions-map))


(provide 'consult-gh-embark)
#+end_src
